configuration/Catalogs/fast8Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>fast8Процессы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяКонтроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Создание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Управление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоРасписанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fast8ВидыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fast8ВидыЕдиницПериода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/InformationRegisters/fast8ИсторияВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>fast8ИсторияВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fast8СтатусыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fast8Процессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.fast8Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/fast8СтатусыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>fast8СтатусыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращеноНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Enums/fast8ВидыПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>fast8ВидыПериодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недельное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Датой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Enums/fast8ВидыЕдиницПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>fast8ВидыЕдиницПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/fast8Процессы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//MIT License
//
//Copyright (c) 2023 FAST8.RU
//
//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:
//
//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.
//
//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеСервер Тогда
	Элементы.ГруппаАдминистративныйИнтерфейс.Видимость = Ложь;
	Элементы.Картинка.Гиперссылка = Ложь;
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Исполнитель,
	|	СУММА(ВЫБОР
	|		КОГДА fast8ИсторияВыполненияЗаданийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполнено)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Выполнено,
	|	СУММА(ВЫБОР
	|		КОГДА fast8ИсторияВыполненияЗаданийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Отменено)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Отменено
	|ИЗ
	|	РегистрСведений.fast8ИсторияВыполненияЗаданий.СрезПоследних(, Процесс = &Процесс) КАК
	|		fast8ИсторияВыполненияЗаданийСрезПоследних
	|ГДЕ
	|	Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполнено), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Отменено))
	|СГРУППИРОВАТЬ ПО
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Исполнитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выполнено УБЫВ,
	|	Отменено";
	Запрос.УстановитьПараметр("Процесс", Объект.Ссылка);
	Статистика.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект), АдресВременнойКартинки,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры // КартинкаНажатие()

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда 
		АдресВременнойКартинки = Адрес;
		Картинка = АдресВременнойКартинки;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьКартинкуЗавершение()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресВременнойКартинки) Тогда 
		ДанныеКартинки = ПолучитьИзВременногоХранилища(АдресВременнойКартинки);
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДанныеКартинки);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура РасписаниеПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьСписокВыбораЕдиницы(ТекущиеДанные.Вид);
	КонецЕсли;
	
КонецПроцедуры // РасписаниеПриАктивизацииСтроки()

&НаКлиенте
Процедура ЗаполнитьСписокВыбораЕдиницы(Вид)
	
	Элементы.РасписаниеЕдиница.СписокВыбора.Очистить();
	Если Вид = ПредопределенноеЗначение("Перечисление.fast8ВидыПериодов.Датой") Тогда
		Элементы.РасписаниеЕдиница.СписокВыбора.Очистить();
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.День"));
		Элементы.РасписаниеПорядок.МинимальноеЗначение = 1;
		Элементы.РасписаниеПорядок.МаксимальноеЗначение = 366;
	ИначеЕсли Вид = ПредопределенноеЗначение("Перечисление.fast8ВидыПериодов.Недельное") Тогда
		Элементы.РасписаниеЕдиница.СписокВыбора.Очистить();
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Понедельник"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Вторник"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Среда"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Четверг"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Пятница"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Суббота"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Воскресенье"));
		Элементы.РасписаниеПорядок.МинимальноеЗначение = 0;
		Элементы.РасписаниеПорядок.МаксимальноеЗначение = 0;
	ИначеЕсли Вид = ПредопределенноеЗначение("Перечисление.fast8ВидыПериодов.Месячное") Тогда
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.День"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Понедельник"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Вторник"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Среда"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Четверг"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Пятница"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Суббота"));
		Элементы.РасписаниеЕдиница.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.fast8ВидыЕдиницПериода.Воскресенье"));
		Элементы.РасписаниеПорядок.МинимальноеЗначение = 1;
		Элементы.РасписаниеПорядок.МаксимальноеЗначение = 31;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСписокВыбораЕдиницы()

&НаКлиенте
Процедура РасписаниеВидПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расписание.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьСписокВыбораЕдиницы(ТекущиеДанные.Вид);
		Если ТекущиеДанные.Вид = ПредопределенноеЗначение("Перечисление.fast8ВидыПериодов.Недельное") Тогда
			ТекущиеДанные.Порядок = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // РасписаниеВидПриИзменении()
